Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The fully qualified class name (FQCN) of the declaring class is used as a logger name, for example, `org.jboss.logging.Logger.getLogger(SimpleBean.class)` will be used.
ja_jp: 宣言するクラスの完全修飾クラス名 (FQCN) は、ロガー名として使用されます。たとえば、 `org.jboss.logging.Logger.getLogger(SimpleBean.class)` が使用されます。

source: The fully qualified name of the generated resource
ja_jp: 生成されたリソースの完全修飾名

source: The function can also be invoked locally with the SAM CLI like this:
ja_jp: この関数は、以下のようにSAM CLI によってローカルで呼び出すこともできます。

source: The function given to the `withTransaction` method receives a `TransactionalEmitter` for producing records, and returns a `Uni` that provides the result of the transaction.
ja_jp: `withTransaction` メソッドに指定された関数は、レコードの生成用に `TransactionalEmitter` を受け取り、トランザクションの結果を提供する `Uni` を返します。

source: The function given to the `withTransaction` method receives a `TransactionalEmitter` for producing records, and returns a `Uni` that provides the result of the transaction. If the processing completes successfully, the producer is flushed and the transaction is committed. If the processing throws an exception, returns a failing `Uni`, or marks the `TransactionalEmitter` for abort, the transaction is aborted.
ja_jp: `withTransaction` メソッドに渡される関数は、レコードを生成する `TransactionalEmitter` を受け取り、トランザクションの結果を提供する `Uni` を返します。 処理が正常に完了すると、プロデューサーがフラッシュされ、トランザクションがコミットされます。 処理中に例外が発生したり、失敗した `Uni` が返されたり、 `TransactionalEmitter` が中止の対象としてマークされたりすると、トランザクションは中止されます。

source: The function must be a CDI bean
ja_jp: 関数はCDI Beanでなければなりません。

source: The function name defaults to the method name and is case sensitive. If you want your function referenced by a different name, parameterize the `@Funq` annotation as follows:
ja_jp: 関数名の既定値はメソッド名で、大文字と小文字を区別します。関数を別の名前で参照したい場合は、 `@Funq` アノテーションを次のようにパラメータ化します。

source: The function name defaults to the method name and is case-sensitive. If you want your function referenced by a different name, parameterize the `@Funq` annotation as follows:
ja_jp: ファンクション名のデフォルト値はメソッド名で、大文字と小文字は区別されます。ファンクションを別の名前で参照したい場合は、以下のように `@Funq` アノテーションにパラメータを記述します。

source: The fundamental promise of a Quarkus platform is any combination of the Quarkus extensions the platform consists of can be used in the same application without causing any conflict for each other. Each organization creating their Quarkus platform may establish their own criteria for the extensions to be accepted into the platform and the means to guarantee the compatibility between the accepted extensions.
ja_jp: Quarkusプラットフォームの基本的な約束事は、プラットフォームで構成されるQuarkusエクステンションを組み合わせて、お互いに競合することなく同じアプリケーションで使用することができるということです。Quarkusプラットフォームを作成する各組織は、プラットフォームに受け入れられるエクステンションについて独自の基準を設定し、受け入れられたエクステンション間の互換性を保証する手段を確立することができます。

source: The future releases of Quarkus will remove the expectation for `docker` command available on `PATH`.
ja_jp: 今後のQuarkusのリリースでは、 `docker` コマンドが `PATH` で利用できることへの依存がなくなる予定です。

source: The gRPC Reflection Service is enabled in dev mode by default. That lets you use tools such as `grpcurl`. In production mode, the reflection service is disabled. You can enable it explicitly using `quarkus.grpc-server.enable-reflection-service=true`.
ja_jp: gRPC Reflection Service は、開発モードではデフォルトで有効になっています。これにより、 `grpcurl` のようなツールを使用することができます。本番モードでは、リフレクションサービスは無効になっています。 `quarkus.grpc-server.enable-reflection-service=true` を使って明示的に有効にすることができます。

source: The gRPC methods receiving _streams_, such as a `Multi` cannot use `@RunOnVirtualThread`, as the method must not be blocking and produce its result (`Multi` or `Uni`) immediately.
ja_jp: `Multi` などの _streams_ を受信する gRPC メソッドは、メソッドがブロッキングや結果 (`Multi` または `Uni`) の即時生成を実行してはならないため、 `@RunOnVirtualThread` は使用できません。

source: The gRPC server
ja_jp: gRPCサーバー

source: The gRPC services can be secured with the xref:security-authorize-web-endpoints-reference.adoc#standard-security-annotations[standard security annotations] like in the example below:
ja_jp: gRPC サービスは、次の例のように、xref:security-authorize-web-endpoints-reference.adoc#standard-security-annotations[標準セキュリティーアノテーション] を使用して保護できます。

source: The garbage collectors available for Quarkus users are currently Serial GC and Epsilon GC.
ja_jp: Quarkusのユーザーが利用できるガベージコレクタは、現在、Serial GCとEpsilon GCです。

source: The general `status` of the health check is computed as a logical AND of all the declared health check procedures. The `checks` array is empty as we have not specified any health check procedure yet so let's define some.
ja_jp: ヘルスチェックの一般的な `status` は、宣言されたすべてのヘルスチェックの論理的な AND として計算されます。 `checks` 配列は、まだヘルスチェックの手順を指定していないので空ですが、いくつか定義してみましょう。

source: The general idea is to group the resource methods into distinct profiles. This is achieved using an `@Extension(name = "x-smallrye-profile-<profile-name>", value = "")` annotation. The `x-smallrye-profile-` part is a prefix, and `<profile-name>` is a name for the profile which is freely definable.
ja_jp: 一般的な考え方は、リソースメソッドを個別のプロファイルにグループ化することです。これは `@Extension(name = "x-smallrye-profile-<profile-name>", value = "")` アノテーションを使用して行います。`x-smallrye-profile-` の部分はプレフィックスで、`<profile-name>` は自由に定義できるプロファイルの名前です。

source: The generated AOT cache file can be included directly in your container image.
ja_jp: 生成された AOT キャッシュファイルは、コンテナーイメージに直接含めることができます。

source: The generated CA is located in `$HOME/.quarkus/quarkus-dev-root-ca.pem`, and installed in the system truststore.
ja_jp: 生成された CA は `$HOME/.quarkus/quarkus-dev-root-ca.pem` に配置され、システムトラストストアにインストールされます。

source: The generated OpenAPI documents by default include every schema, even those referenced by operations which are excluded. The following configuration removes any unused schema.
ja_jp: 生成された OpenAPI ドキュメントには、デフォルトですべてのスキーマが含まれます。これには除外されたオペレーションによって参照されているものも含まれます。次の設定により、使用されていないスキーマがすべて削除されます。

source: The generated `kubernetes.yml` will look like:
ja_jp: 生成された `kubernetes.yml` は以下のようになります。

source: The generated `pom.xml` contains the following modifications compared to its counterpart when Kotlin is not selected:
ja_jp: 生成された `pom.xml` には、Kotlin が選択されていない場合と比較して、以下の修正が含まれています。

source: The generated `service` contains the following:
ja_jp: 生成された `service` には、以下の内容が含まれます。

source: The generated code exposes a different API; each method delegating to the "bare" API. Asynchronous methods and streams can follow different transformations, so the resulting API uses the right idioms.
ja_jp: 生成されたコードは、異なる API を公開しており、各メソッドは「素」の API にデリゲートします。非同期メソッドとストリームは異なる変換を行うことができるので、生成されたAPIは適切なイディオムを使用します。

source: The generated content encryption key is encrypted using the supplied key and a key encryption algorithm such as `RSA-OAEP`.
ja_jp: 生成されたコンテンツ暗号鍵は、提供されたキーと RSA-OAEP などのキー暗号化アルゴリズムを使用して暗号化されます。

source: The generated coverage report will be in the `my-extension-project/target/coverage` directory.
ja_jp: 生成されるカバレッジレポートは `my-extension-project/target/coverage` ディレクトリに出力されます。

source: The generated manifest can be applied to the cluster from the project root using `kubectl`:
ja_jp: 生成されたマニフェストは、 `kubectl` を使用してプロジェクトのルートからクラスターに適用することができます。

source: The generated manifest can be applied to the cluster from the project root using kubectl:
ja_jp: 生成されたマニフェストは、kubectl を使用してプロジェクトのルートからクラスターに適用することができます。

source: The generated manifest can be deployed as is to a running cluster, using `kubectl`:
ja_jp: 生成されたマニフェストは、 `kubectl` を使用して、実行中のクラスターにそのままデプロイすることができます。

source: The generated manifests use the Kubernetes link:https://kubernetes.io/docs/concepts/overview/working-with-objects/common-labels[recommended labels]. These labels can be customized using `quarkus.kubernetes.name`, `quarkus.kubernetes.version` and `quarkus.kubernetes.part-of`. For example by adding the following configuration to your `application.properties`:
ja_jp: 生成されたマニフェストには、Kubernetes link:https://kubernetes.io/docs/concepts/overview/working-with-objects/common-labels[推奨のラベル]が使用されます。これらのラベルは、 `quarkus.kubernetes.name`, `quarkus.kubernetes.version` および `quarkus.kubernetes.part-of` を使用してカスタマイズすることができます。例えば、 `application.properties` に以下の設定を追加してください:

source: The generated project contains a simple test. Edit the `src/test/java/org/acme/GreetingResourceTest.java` to match the following content:
ja_jp: 生成されたプロジェクトには簡単なテストが含まれています。 `src/test/java/org/acme/getting/started/GreetingResourceTest.java` を以下の内容に合わせて編集してください。

source: The generated project has three lambdas within it. Two that implement the `RequestHandler<?, ?>` interface, and one that implements the `RequestStreamHandler` interface. One that is used and two that are unused. If you open up `src/main/resources/application.properties` you'll see this:
ja_jp: 生成されたプロジェクトは、その中に3つの Lambda を持っています。 `RequestHandler<?, ?>` インターフェイスを実装したものが 2 つ、 `RequestStreamHandler` インターフェイスを実装したものが 1 つ。1つは使用され、2つは未使用です。 `src/main/resources/application.properties` を開くと、このようになります。

source: The generated repositories are also registered as beans so they can be injected into any other bean. Furthermore the methods that update the database are automatically annotated with `@Transactional`.
ja_jp: 生成されたリポジトリーも Bean として登録されるため、他の Bean に注入できます。さらに、データベースを更新するメソッドには、自動的に `@Transactional` のアノテーションが付けられます。

source: The generated repositories are also registered as beans so they can be injected into any other bean. Furthermore, the methods that update the database are automatically annotated with `@Transactional`.
ja_jp: 生成されたリポジトリーも Bean として登録されるため、他の Bean に注入できます。さらに、データベースを更新するメソッドには、自動的に `@Transactional` のアノテーションが付けられます。

source: The generated resource
ja_jp: 生成されたリソース

source: The generated resources use a Kubernetes `Deployment`, but still make use of OpenShift-specific resources, such as `Route`, `BuildConfig`, and so on.
ja_jp: 生成されたリソースは Kubernetes `Deployment` を使用しますが、 `Route` や `BuildConfig` などの OpenShift 固有のリソースを使用します。

source: The generated resources will be functionally equivalent for both entities and repositories. The only difference being the particular data access pattern and data storage in use.
ja_jp: 生成されるリソースは、エンティティーとリポジトリの両方で機能的に同等となります。唯一の違いは、利用時の特定のデータアクセスパターンとデータストレージです。

source: The generated service can be customized using the following properties:
ja_jp: 生成されたサービスは、以下のプロパティーを使用してカスタマイズすることができます:

source: The generated static metamodel allows for building queries in a type-safe manner. Let's consider having a simple entity:
ja_jp: 生成された静的メタモデルを使用すると、型安全な方法でクエリーを構築できます。シンプルなエンティティを考えてみましょう。

source: The generated value resolver knows how to invoke the `BigDecimal.setScale()` method.
ja_jp: 生成された値リゾルバは、 `BigDecimal.setScale()` メソッドを呼び出す方法を知っています。

source: The generated web link for this resource is `Link: <http://localhost:8080/search/{text}>; rel="search records by free text"`.
ja_jp: このリソースに対して生成された Web リンクは `Link: <http://localhost:8080/search/{text}>; rel="search records by free text"` です。

source: The generation of the `.debug` file depends on `objcopy`. As a result, when using a local GraalVM installation on common Linux distributions you will need to install the `binutils` package:
ja_jp: `.debug` ファイルの生成は `objcopy` に依存します。 その結果、一般的な Linux ディストリビューションでローカル GraalVM インストールを使用する場合は、 `binutils` パッケージをインストールする必要があります。

source: The generation of the `.debug` file depends on `objcopy`. As a result, when using a local GraalVM installation on common Linux distributions, you will need to install the `binutils` package:
ja_jp: `.debug` ファイルの生成は `objcopy` に依存しています。その結果、一般的な Linux ディレクトリーでローカルの GraalVM インストールを使用する場合、`binutils` パッケージをインストールする必要があります。

source: The generation of the `.debug` file depends on `objcopy`. On common Linux distributions you will need to install the `binutils` package:
ja_jp: `.debug` ファイルの生成は `objcopy` に依存します。一般的な Linux ディストリビューションでは、 `binutils` パッケージをインストールする必要があります。

source: The generation of the bundle can be activated by setting any of the following parameters:
ja_jp: バンドルの生成は、以下のいずれかのパラメーターを設定することで有効にできます。

source: The generator sources
ja_jp: ジェネレーターのソース

source: The given key (weather station id) is maintained by the local application node, i.e. it can answer the query itself
ja_jp: 与えられたキー(weather station id)はローカルのアプリケーションノードによって管理されています。つまり、それ自身がクエリに答えることができます

source: The given key is maintained by another application node; in this case the information about that node (host and port) will be returned
ja_jp: 与えられたキーが他のアプリケーションノードによって管理されている。この場合、そのノードに関する情報(ホストとポート)が返されます

source: The goal accepts the following optional parameters:
ja_jp: ゴールは、以下のオプションのパラメーターを受け入れます。

source: The goal of STM is to simplify object reads and writes from multiple threads/protect state from concurrent updates. The Quarkus STM implementation will safely manage any conflicts between these threads using whatever isolation model has been chosen to protect that specific state instance (object in the case of Quarkus). In Quarkus STM, there are two isolation implementations, pessimistic (the default), which would cause conflicting threads to be blocked until the original has completed its updates (committed or aborted the transaction); then there's the optimistic approach which allows all of the threads to proceed and checks for conflicts at commit time, where one or more of the threads may be forced to abort if there have been conflicting updates.
ja_jp: STM の目的は、オブジェクト読み込みを簡素化し、複数のスレッドから書き込みを行い、同時更新からの状態を保護することです。Quarkus の STM 実装では、特定のステートインスタンス (Quarkus の場合はオブジェクト) を保護するために選択された分離モデルを使用して、これらのスレッド間の競合を安全に管理します。Quarkus STM で は、2つの分離実装があります。ペシミスティックアプローチ (デフォルト) では、元のスレッドが更新を完了する (コミットまたはトランザクションを中止する) まで競合するスレッドがブロックされます。一方、オプティミスティックアプローチでは、すべてのスレッドの続行を許可し、同時に競合をチェックします。ここでは、競合更新がある場合は、1 つ以上のスレッドが強制的に中止されることがあります。

source: The goal of STM is to simplify object reads and writes from multiple threads/protect state from concurrent updates. The Quarkus STM implementation will safely manage any conflicts between these threads using whatever isolation model has been chosen to protect that specific state instance (object in the case of Quarkus). In Quarkus STM, there are two isolation implementations, pessimistic (the default), which would cause conflicting threads to be blocked until the original has completed its updates (committed or aborted the transaction); then there's the optimistic approach which allows all the threads to proceed and checks for conflicts at commit time, where one or more of the threads may be forced to abort if there have been conflicting updates.
ja_jp: STM の目的は、オブジェクト読み込みを簡素化し、複数のスレッドから書き込みを行い、同時更新からの状態を保護することです。Quarkus の STM 実装では、特定のステートインスタンス (Quarkus の場合はオブジェクト) を保護するために選択された分離モデルを使用して、これらのスレッド間の競合を安全に管理します。Quarkus STM で は、2つの分離実装があります。ペシミスティックアプローチ (デフォルト) では、元のスレッドが更新を完了する (コミットまたはトランザクションを中止する) まで競合するスレッドがブロックされます。一方、オプティミスティックアプローチでは、すべてのスレッドの続行を許可し、同時に競合をチェックします。ここでは、競合更新がある場合は、1 つ以上のスレッドが強制的に中止されることがあります。

source: The goal of this blog post is to show how Project Leyden helped us uncover things that had been hidden for far too long. And hopefully, this will give other library and framework authors a few useful ideas, and ultimately help improve the Java ecosystem as a whole.
ja_jp: このブログ投稿の目的は、Project Leyden が、あまりにも長い間隠されていたものを明らかにするのにいかに役立ったかを示すことです。そして、これが他のライブラリーやフレームワークの作者にいくつかの有益なアイデアを提供し、最終的に Java エコシステム全体の改善につながることを願っています。

source: The goal that we want to achieve is putting the evaluation of these rules in a microservice, exposing them in a REST endpoint developed with Quarkus. To do so it is enough to add the Drools Quarkus extension among the dependencies of your project.
ja_jp: 目標として、マイクロサービスに、これらのルールの評価を配置し、Quarkus で開発した REST エンドポイントに公開します。これには、プロジェクトの依存関係に Drools Quarkus エクステンションを追加するだけで十分です。

source: The good news is that upgrading to Quarkus 2.0 will be very low effort and, as usual, we have a https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.0[migration guide] to help you.
ja_jp: 良いニュースとしては、Quarkus 2.0へのアップグレードは非常に簡単で、いつものように link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-2.0[移行ガイド]を用意しています。

source: The group id of the created project
ja_jp: 作成されたプロジェクトのグループID

source: The group id of the target platform.
ja_jp: ターゲットプラットフォームのグループID

source: The group number is actually not compared to the CPU load directly; instead, it is compared to a function of CPU load. The function is `(1 - load^3) * 640`, where `load` is the CPU load as a number between 0.0 and 1.0, and 640 is a number of requests group as mentioned above.
ja_jp: 実際、グループ番号は CPU 負荷と直接比較されるのではなく、CPU 負荷の関数と比較されます。この関数は `(1 - load^3) * 640` であり、 `load` は 0.0 から 1.0 までの数値としての CPU 負荷、640 は前述のリクエストグループの数です。

source: The guide assumes that you have the https://devcenter.heroku.com/articles/heroku-cli[Heroku CLI] installed.
ja_jp: このガイドでは、 link:https://devcenter.heroku.com/articles/heroku-cli[Heroku CLI]がインストールされていることを前提としています。

source: The guide can be used either via the Apache Qpid JMS AMQP client as detailed immediately below, or alternatively with the Apache ActiveMQ Artemis JMS client given some different configuration as <<artemis-jms, detailed later>>.
ja_jp: このガイドは、すぐ下で詳しく説明する Apache Qpid JMS AMQP クライアントを介して使うこともできますし、 link:#artemis-jms[後ほど詳しく説明する] ように、Apache ActiveMQ Artemis JMS クライアントを介して使うこともできます。

source: The guide can be used either via the Apache Qpid JMS AMQP client as detailed immediately below, or alternatively with the Apache ActiveMQ Artemis JMS client given some different configuration as <<artemis-jms,detailed later>>.
ja_jp: このガイドでは、以下のようにApache Qpid JMS AMQPクライアントを使用することもできます。 あるいは、Apache ActiveMQ Artemis JMSクライアントを使用して、<<artemis-jms,後述のように>> いくつかの異なる設定を行うこともできます。

source: The guide can be used either via the Apache Qpid JMS AMQP client as detailed immediately below, or alternatively with the Apache ActiveMQ Artemis JMS client given some different configuration as xref:artemis-jms[detailed later].
ja_jp: このガイドは、すぐ下で説明しているApache Qpid JMS AMQPクライアントを使うか、 xref:artemis-jms[後で詳しく説明するよう] に、Apache ActiveMQ Artemis JMSクライアントでいくつかの異なる設定を行うことができます。

source: The guide walks through quickstart code to show you how you can deploy Funqy as a standalone service and invoke on Funqy functions using HTTP.
ja_jp: このガイドでは、Funqyをスタンドアロンサービスとしてデプロイし、HTTPを使ってFunqy関数を呼び出す方法をクイックスタートコードで説明します。

source: The guide walks through quickstart code to show you how you can deploy Funqy functions to AWS Lambda.
ja_jp: このガイドでは、Funqy 関数を WS Lambda にデプロイする方法をクイックスタートコードで説明しています。

source: The guide walks through quickstart code to show you how you can deploy Funqy functions to Amazon Lambda.
ja_jp: このガイドでは、Funqy関数をAmazon Lambdaにデプロイする方法をクイックスタートコードで説明しています。

source: The guide walks through quickstart code to show you how you can deploy Funqy functions to Google Cloud Functions.
ja_jp: このガイドでは、Funqy 関数を Google Cloud Functions にデプロイする方法をクイックスタートコードで説明しています。

source: The guide walks through quickstart code to show you how you can deploy and invoke on Funqy functions with Knative Events.
ja_jp: このガイドでは、クイックスタートコードを使って、Knative Events を使って Funqy 関数をデプロイして呼び出す方法を説明します。

source: The guide will walk you through developing and running a simple application that uses both supported types of GraphQL clients to retrieve data from a remote resource, that being a database related to Star Wars. It's available at https://graphql.org/swapi-graphql[this webpage] if you want to experiment with it manually. The web UI allows you to write and execute GraphQL queries against it.
ja_jp: このガイドでは、サポートされている両方のタイプのGraphQLクライアントを使用して、リモートリソース（スターウォーズ関連のデータベース）からデータを取得するシンプルなアプリケーションの開発と実行について説明しています。このガイドは link:https://graphql.org/swapi-graphql[このウェブページ]で公開されているので、手動で試してみたい方はぜひご覧ください。Web UIでは、このアプリケーションに対してGraphQLクエリを書いて実行することができます。

source: The handler is called with details of the deserialization, including the action represented as `Uni<T>`. On the deserialization `Uni` failure strategies like retry, providing a fallback value or applying timeout can be implemented.
ja_jp: ハンドラーは、 `Uni<T>` と表されるアクションを含む、デシリアライゼーションの詳細とともに呼び出されます。 再試行などのデシリアライゼーション `Uni` エラーストラテジーでは、フォールバック値の提供やタイムアウトの適用を実装できます。

source: The handler is called with details of the serialization, including the action represented as `Uni<byte[]>`. Note that the method must await on the result and return the serialized byte array.
ja_jp: ハンドラーは、 `Uni<byte[]>` として表されるアクションを含むシリアライゼーションの詳細とともに呼び出されます。 メソッドは結果を待機し、シリアライズされたバイト配列を返す必要があることに注意してください。

source: The header, which contains metadata about the token, such as the signing algorithm.
ja_jp: 署名アルゴリズムなどのトークンに関するメタデータが含まれるヘッダー。

source: The health check uses OIDC endpoint discovery to validate the connection. Therefore, discovery must be enabled.
ja_jp: ヘルスチェックは OIDC エンドポイントディスカバリーを使用して接続を検証します。したがって、ディスカバリーを有効にする必要があります。

source: The heart of our application is the Go CEL implementation, compiled to WebAssembly. The Go code implements three key exported functions:
ja_jp: アプリケーションの核心は、WebAssembly にコンパイルされた Go CEL 実装です。Go コードは、3 つの主要なエクスポート関数を実装しています。

source: The host URLs here must be some of the cluster members. Not all cluster members need to be configured, as the client will obtain a full cluster topology from one of the known servers. However, it is advisable to configure at least 2 or 3 nodes, not just 1.
ja_jp: ここでのホスト URL は、クラスターメンバーの一部である必要があります。 クライアントは既知のサーバーの 1 つから完全なクラスタートポロジーを取得するため、すべてのクラスターメンバーを設定する必要はありません。 ただし、1 つのノードだけではなく、少なくとも 2 つまたは 3 つのノードを設定することを推奨します。

source: The host URLs here must be the sentinel servers. The client will obtain the URLs of actual Redis servers (master or replicas, depending on `role`) from one of the sentinels, using the `master-name` as an identifier of the "master set".
ja_jp: ここでのホスト URL は sentinel サーバーである必要があります。 クライアントは、マスターセットの識別子として `master-name` を使用して、sentinel の 1 つから実際の Redis サーバー (`role` に応じてマスターまたはレプリカ) の URL を取得します。

source: The host provider can be used to configure the redis client like shown below
ja_jp: 以下に示すように、ホストプロバイダーを使用して redis クライアントを設定することができます。

source: The http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-types-v1.0-os.html[AMQP Type System] defines the supported types.
ja_jp: http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-types-v1.0-os.html[AMQP Type System] は、サポートされるタイプを定義します。

source: The http://smallrye.io/smallrye-stork/1.0.0.Beta1/quarkus/[project's documentation] describes step by step how to use Stork with the REST Client, using Consul and round-robin load balancer as examples.
ja_jp: link:http://smallrye.io/smallrye-stork/1.0.0.Beta1/quarkus/[プロジェクトのドキュメント]では、Consulとラウンドロビン型ロードバランサーを例に、RESTクライアントでStorkを使用する方法がステップバイステップで説明されています。

source: The https://access.redhat.com/articles/7041372[deprecation document] contains additional information about how to set up/use automatic rollbacks, triggers, lifecycle hooks, and custom strategies.
ja_jp: link:https://access.redhat.com/articles/7041372[非推奨を宣言したドキュメント] には、自動ロールバック、トリガー、ライフサイクルフック、カスタムストラテジーの設定/使用方法に関する追加情報が含まれています。

source: The https://docs.asciidoctor.org/asciidoc/latest/syntax-quick-reference/[AsciiDoc syntax reference]
ja_jp: https://docs.asciidoctor.org/asciidoc/latest/syntax-quick-reference/[Asciidoc 構文リファレンス]

source: The https://docs.aws.amazon.com/serverless-application-model/latest/developerguide/serverless-sam-cli-install.html[AWS SAM CLI] allows you to run your functions locally on your laptop in a simulated Lambda environment. This requires https://www.docker.com/products/docker-desktop[docker] to be installed. This is an optional approach should you choose to take advantage of it. Otherwise, the Quarkus JUnit integration should be sufficient for most of your needs.
ja_jp: link:https://docs.aws.amazon.com/serverless-application-model/latest/developerguide/serverless-sam-cli-install.html[AWS SAM CLI] を利用すると、Lambda をシミュレートした環境でラップトップ上のローカルで関数を実行することができます。これには link:https://www.docker.com/products/docker-desktop[docker] のインストールが必要です。これは、利用することを選択した場合のオプションのアプローチです。それ以外の場合は、Quarkus JUnitの統合でほとんどのニーズを満たすことができるはずです。
